In [3]:
import pandas as pd
import numpy as np

df = pd.DataFrame({'one': [np.nan, np.nan, 0.119209, -2.104569, np.nan],
                   'two': [-0.282863, 1.212112, -1.044236, -0.494929, -0.706771],
                   'three': [-1.509059, 0.173215, -0.861849, 1.071804, -1.039575]},
                  index=["a","c","e","f","h"],)
df.cumsum(skipna=False)

   one       two     three
a  NaN -0.282863 -1.509059
c  NaN  0.929249 -1.335844
e  NaN -0.114987 -2.197693
f  NaN -0.609916 -1.125889
h  NaN -1.316687 -2.165464

In [10]:
df["one"]

a         NaN
c         NaN
e    0.119209
f   -2.104569
h         NaN
Name: one, dtype: float64

In [11]:
pd.isna(df["one"]) , df.isna()

(a     True
 c     True
 e    False
 f    False
 h     True
 Name: one, dtype: bool,
      one    two  three
 a   True  False  False
 c   True  False  False
 e  False  False  False
 f  False  False  False
 h   True  False  False)

In [13]:
df["one"].notna()

a    False
c    False
e     True
f     True
h    False
Name: one, dtype: bool

In [14]:
pd.Series([1, 2, np.nan, 4], dtype=pd.Int64Dtype())

0       1
1       2
2    <NA>
3       4
dtype: Int64

In [16]:
df["timestamp"] = pd.Timestamp("20120101")

In [17]:
df

        one       two     three  timestamp
a       NaN -0.282863 -1.509059 2012-01-01
c       NaN  1.212112  0.173215 2012-01-01
e  0.119209 -1.044236 -0.861849 2012-01-01
f -2.104569 -0.494929  1.071804 2012-01-01
h       NaN -0.706771 -1.039575 2012-01-01

In [6]:
df.loc[["a", "c", "h"], ["one", "timestamp"]] =  np.nan
df

NameError: name 'np' is not defined

In [24]:
df.fillna(0)

        one       two     three            timestamp
a  0.000000 -0.282863 -1.509059                    0
c  0.000000  1.212112  0.173215                    0
e  0.119209 -1.044236 -0.861849  2012-01-01 00:00:00
f -2.104569 -0.494929  1.071804  2012-01-01 00:00:00
h  0.000000 -0.706771 -1.039575                    0

In [27]:
df["one"].fillna("missing")

a     missing
c     missing
e    0.119209
f   -2.104569
h     missing
Name: one, dtype: object

In [31]:
df.fillna(method="pad")

        one       two     three  timestamp
a       NaN -0.282863 -1.509059        NaT
c       NaN  1.212112  0.173215        NaT
e  0.119209 -1.044236 -0.861849 2012-01-01
f -2.104569 -0.494929  1.071804 2012-01-01
h -2.104569 -0.706771 -1.039575 2012-01-01